/* automatically generated by rust-bindgen 0.63.0 */

pub const DART_API_DL_MAJOR_VERSION: u32 = 2;
pub const DART_API_DL_MINOR_VERSION: u32 = 1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Dart_Handle {
	_unused: [u8; 0],
}
/// An object reference managed by the Dart VM garbage collector.
///
/// Because the garbage collector may move objects, it is unsafe to
/// refer to objects directly. Instead, we refer to objects through
/// handles, which are known to the garbage collector and updated
/// automatically when the object is moved. Handles should be passed
/// by value (except in cases like out-parameters) and should never be
/// allocated on the heap.
///
/// Most functions in the Dart Embedding API return a handle. When a
/// function completes normally, this will be a valid handle to an
/// object in the Dart VM heap. This handle may represent the result of
/// the operation or it may be a special valid handle used merely to
/// indicate successful completion. Note that a valid handle may in
/// some cases refer to the null object.
///
/// --- Error handles ---
///
/// When a function encounters a problem that prevents it from
/// completing normally, it returns an error handle (See Dart_IsError).
/// An error handle has an associated error message that gives more
/// details about the problem (See Dart_GetError).
///
/// There are four kinds of error handles that can be produced,
/// depending on what goes wrong:
///

pub const Dart_CObject_Type_Dart_CObject_kSendPort: Dart_CObject_Type = Dart_CObject_Type(10);
pub const Dart_CObject_Type_Dart_CObject_kCapability: Dart_CObject_Type = Dart_CObject_Type(11);
pub const Dart_CObject_Type_Dart_CObject_kNativePointer: Dart_CObject_Type = Dart_CObject_Type(12);
pub const Dart_CObject_Type_Dart_CObject_kUnsupported: Dart_CObject_Type = Dart_CObject_Type(13);
pub const Dart_CObject_Type_Dart_CObject_kNumberOfTypes: Dart_CObject_Type = Dart_CObject_Type(14);
#[repr(transparent)]
/// A Dart_CObject is used for representing Dart objects as native C
/// data outside the Dart heap. These objects are totally detached from
/// the Dart heap. Only a subset of the Dart objects have a
/// representation as a Dart_CObject.
///
/// The string encoding in the 'value.as_string' is UTF-8.
///
/// All the different types from dart:typed_data are exposed as type
/// kTypedData. The specific type from dart:typed_data is in the type
/// field of the as_typed_data structure. The length in the
/// as_typed_data structure is always in bytes.
///
/// The data for kTypedData is copied on message send and ownership remains with
/// the caller. The ownership of data for kExternalTyped is passed to the VM on
/// message send and returned when the VM invokes the
/// Dart_HandleFinalizer callback; a non-NULL callback must be provided.
///
/// Note that Dart_CObject_kNativePointer is intended for internal use by
/// dart:io implementation and has no connection to dart:ffi Pointer class.
/// It represents a pointer to a native resource of a known type.
/// The receiving side will only see this pointer as an integer and will not
/// see the specified finalizer.
/// The specified finalizer will only be invoked if the message is not delivered.
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct Dart_CObject_Type(pub ::std::os::raw::c_int);
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _Dart_CObject {
	pub type_: Dart_CObject_Type,
	pub value: _Dart_CObject__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _Dart_CObject__bindgen_ty_1 {
	pub as_bool: bool,
	pub as_int32: i32,
	pub as_int64: i64,
	pub as_double: f64,
	pub as_string: *mut ::std::os::raw::c_char,
	pub as_send_port: _Dart_CObject__bindgen_ty_1__bindgen_ty_1,
	pub as_capability: _Dart_CObject__bindgen_ty_1__bindgen_ty_2,
	pub as_array: _Dart_CObject__bindgen_ty_1__bindgen_ty_3,
	pub as_typed_data: _Dart_CObject__bindgen_ty_1__bindgen_ty_4,
	pub as_external_typed_data: _Dart_CObject__bindgen_ty_1__bindgen_ty_5,
	pub as_native_pointer: _Dart_CObject__bindgen_ty_1__bindgen_ty_6,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Dart_CObject__bindgen_ty_1__bindgen_ty_1 {
	pub id: Dart_Port,
	pub origin_id: Dart_Port,
}
#[test]
fn bindgen_test_layout__Dart_CObject__bindgen_ty_1__bindgen_ty_1() {
	const UNINIT: ::std::mem::MaybeUninit<_Dart_CObject__bindgen_ty_1__bindgen_ty_1> =
		::std::mem::MaybeUninit::uninit();
	let ptr = UNINIT.as_ptr();
	assert_eq!(
		::std::mem::size_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_1>(),
		16usize,
		concat!("Size of: ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_1))
	);
	assert_eq!(
		::std::mem::align_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_1>(),
		8usize,
		concat!("Alignment of ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_1))
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(id)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).origin_id) as usize - ptr as usize },
		8usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_1),
			"::",
			stringify!(origin_id)
		)
	);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Dart_CObject__bindgen_ty_1__bindgen_ty_2 {
	pub id: i64,
}
#[test]
fn bindgen_test_layout__Dart_CObject__bindgen_ty_1__bindgen_ty_2() {
	const UNINIT: ::std::mem::MaybeUninit<_Dart_CObject__bindgen_ty_1__bindgen_ty_2> =
		::std::mem::MaybeUninit::uninit();
	let ptr = UNINIT.as_ptr();
	assert_eq!(
		::std::mem::size_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_2>(),
		8usize,
		concat!("Size of: ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_2))
	);
	assert_eq!(
		::std::mem::align_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_2>(),
		8usize,
		concat!("Alignment of ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_2))
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_2),
			"::",
			stringify!(id)
		)
	);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Dart_CObject__bindgen_ty_1__bindgen_ty_3 {
	pub length: isize,
	pub values: *mut *mut _Dart_CObject,
}
#[test]
fn bindgen_test_layout__Dart_CObject__bindgen_ty_1__bindgen_ty_3() {
	const UNINIT: ::std::mem::MaybeUninit<_Dart_CObject__bindgen_ty_1__bindgen_ty_3> =
		::std::mem::MaybeUninit::uninit();
	let ptr = UNINIT.as_ptr();
	assert_eq!(
		::std::mem::size_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_3>(),
		16usize,
		concat!("Size of: ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_3))
	);
	assert_eq!(
		::std::mem::align_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_3>(),
		8usize,
		concat!("Alignment of ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_3))
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_3),
			"::",
			stringify!(length)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).values) as usize - ptr as usize },
		8usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_3),
			"::",
			stringify!(values)
		)
	);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Dart_CObject__bindgen_ty_1__bindgen_ty_4 {
	pub type_: Dart_TypedData_Type,
	pub length: isize,
	pub values: *const u8,
}
#[test]
fn bindgen_test_layout__Dart_CObject__bindgen_ty_1__bindgen_ty_4() {
	const UNINIT: ::std::mem::MaybeUninit<_Dart_CObject__bindgen_ty_1__bindgen_ty_4> =
		::std::mem::MaybeUninit::uninit();
	let ptr = UNINIT.as_ptr();
	assert_eq!(
		::std::mem::size_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_4>(),
		24usize,
		concat!("Size of: ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_4))
	);
	assert_eq!(
		::std::mem::align_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_4>(),
		8usize,
		concat!("Alignment of ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_4))
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_4),
			"::",
			stringify!(type_)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
		8usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_4),
			"::",
			stringify!(length)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).values) as usize - ptr as usize },
		16usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_4),
			"::",
			stringify!(values)
		)
	);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Dart_CObject__bindgen_ty_1__bindgen_ty_5 {
	pub type_: Dart_TypedData_Type,
	pub length: isize,
	pub data: *mut u8,
	pub peer: *mut ::std::os::raw::c_void,
	pub callback: Dart_HandleFinalizer,
}
#[test]
fn bindgen_test_layout__Dart_CObject__bindgen_ty_1__bindgen_ty_5() {
	const UNINIT: ::std::mem::MaybeUninit<_Dart_CObject__bindgen_ty_1__bindgen_ty_5> =
		::std::mem::MaybeUninit::uninit();
	let ptr = UNINIT.as_ptr();
	assert_eq!(
		::std::mem::size_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_5>(),
		40usize,
		concat!("Size of: ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_5))
	);
	assert_eq!(
		::std::mem::align_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_5>(),
		8usize,
		concat!("Alignment of ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_5))
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_5),
			"::",
			stringify!(type_)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
		8usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_5),
			"::",
			stringify!(length)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
		16usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_5),
			"::",
			stringify!(data)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).peer) as usize - ptr as usize },
		24usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_5),
			"::",
			stringify!(peer)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).callback) as usize - ptr as usize },
		32usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_5),
			"::",
			stringify!(callback)
		)
	);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Dart_CObject__bindgen_ty_1__bindgen_ty_6 {
	pub ptr: isize,
	pub size: isize,
	pub callback: Dart_HandleFinalizer,
}
#[test]
fn bindgen_test_layout__Dart_CObject__bindgen_ty_1__bindgen_ty_6() {
	const UNINIT: ::std::mem::MaybeUninit<_Dart_CObject__bindgen_ty_1__bindgen_ty_6> =
		::std::mem::MaybeUninit::uninit();
	let ptr = UNINIT.as_ptr();
	assert_eq!(
		::std::mem::size_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_6>(),
		24usize,
		concat!("Size of: ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_6))
	);
	assert_eq!(
		::std::mem::align_of::<_Dart_CObject__bindgen_ty_1__bindgen_ty_6>(),
		8usize,
		concat!("Alignment of ", stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_6))
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_6),
			"::",
			stringify!(ptr)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
		8usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_6),
			"::",
			stringify!(size)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).callback) as usize - ptr as usize },
		16usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1__bindgen_ty_6),
			"::",
			stringify!(callback)
		)
	);
}
#[test]
fn bindgen_test_layout__Dart_CObject__bindgen_ty_1() {
	const UNINIT: ::std::mem::MaybeUninit<_Dart_CObject__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
	let ptr = UNINIT.as_ptr();
	assert_eq!(
		::std::mem::size_of::<_Dart_CObject__bindgen_ty_1>(),
		40usize,
		concat!("Size of: ", stringify!(_Dart_CObject__bindgen_ty_1))
	);
	assert_eq!(
		::std::mem::align_of::<_Dart_CObject__bindgen_ty_1>(),
		8usize,
		concat!("Alignment of ", stringify!(_Dart_CObject__bindgen_ty_1))
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).as_bool) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1),
			"::",
			stringify!(as_bool)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).as_int32) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1),
			"::",
			stringify!(as_int32)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).as_int64) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1),
			"::",
			stringify!(as_int64)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).as_double) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1),
			"::",
			stringify!(as_double)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).as_string) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1),
			"::",
			stringify!(as_string)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).as_send_port) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1),
			"::",
			stringify!(as_send_port)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).as_capability) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1),
			"::",
			stringify!(as_capability)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).as_array) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1),
			"::",
			stringify!(as_array)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).as_typed_data) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1),
			"::",
			stringify!(as_typed_data)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).as_external_typed_data) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1),
			"::",
			stringify!(as_external_typed_data)
		)
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).as_native_pointer) as usize - ptr as usize },
		0usize,
		concat!(
			"Offset of field: ",
			stringify!(_Dart_CObject__bindgen_ty_1),
			"::",
			stringify!(as_native_pointer)
		)
	);
}
#[test]
fn bindgen_test_layout__Dart_CObject() {
	const UNINIT: ::std::mem::MaybeUninit<_Dart_CObject> = ::std::mem::MaybeUninit::uninit();
	let ptr = UNINIT.as_ptr();
	assert_eq!(
		::std::mem::size_of::<_Dart_CObject>(),
		48usize,
		concat!("Size of: ", stringify!(_Dart_CObject))
	);
	assert_eq!(
		::std::mem::align_of::<_Dart_CObject>(),
		8usize,
		concat!("Alignment of ", stringify!(_Dart_CObject))
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
		0usize,
		concat!("Offset of field: ", stringify!(_Dart_CObject), "::", stringify!(type_))
	);
	assert_eq!(
		unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
		8usize,
		concat!("Offset of field: ", stringify!(_Dart_CObject), "::", stringify!(value))
	);
}
pub type Dart_CObject = _Dart_CObject;
extern "C" {
	/// \mainpage Dynamically Linked Dart API
	///
	/// This exposes a subset of symbols from dart_api.h and dart_native_api.h
	/// available in every Dart embedder through dynamic linking.
	///
	/// All symbols are postfixed with _DL to indicate that they are dynamically
	/// linked and to prevent conflicts with the original symbol.
	///
	/// Link `dart_api_dl.c` file into your library and invoke
	/// `Dart_InitializeApiDL` with `NativeApi.initializeApiDLData`.
	pub fn Dart_InitializeApiDL(data: *mut ::std::os::raw::c_void) -> isize;
}
pub type Dart_Port_DL = i64;
pub type Dart_NativeMessageHandler_DL =
	::std::option::Option<unsafe extern "C" fn(dest_port_id: Dart_Port_DL, message: *mut Dart_CObject)>;
pub type Dart_PostCObject_Type =
	::std::option::Option<unsafe extern "C" fn(port_id: Dart_Port_DL, message: *mut Dart_CObject) -> bool>;
extern "C" {
